; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depotprob6512) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 distributor0)
	(clear crate2)
	(at pallet2 distributor1)
	(clear crate6)
	(at truck0 distributor1)
	(at truck1 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 depot0)
	(on crate1 crate0)
	(at crate2 distributor0)
	(on crate2 pallet1)
	(at crate3 distributor1)
	(on crate3 pallet2)
	(at crate4 depot0)
	(on crate4 crate1)
	(at crate5 distributor1)
	(on crate5 crate3)
	(at crate6 distributor1)
	(on crate6 crate5)
	(at crate7 depot0)
	(on crate7 crate4)
)

(:goal (and
		(on crate0 crate4)
		(on crate2 crate6)
		(on crate4 crate7)
		(on crate5 pallet2)
		(on crate6 pallet1)
		(on crate7 pallet0)
	)
))

; plan
1. (lift hoist1 crate2 pallet1 distributor0)
   deleted: (at crate2 distributor0) (available hoist1) (on crate2 pallet1) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 0 of 6
2. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 0 of 6
3. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   goals met: 0 of 6
4. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 0 of 6
5. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 0 of 6
6. (lift hoist2 crate6 crate5 distributor1)
   deleted: (at crate6 distributor1) (available hoist2) (on crate6 crate5) (clear crate6)
   added: (lifting hoist2 crate6) (clear crate5)
   goals met: 0 of 6
7. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   goals met: 0 of 6
8. (unload hoist2 crate2 truck1 distributor1)
   deleted: (available hoist2) (in crate2 truck1)
   added: (lifting hoist2 crate2)
   goals met: 0 of 6
9. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 0 of 6
10. (unload hoist1 crate6 truck1 distributor0)
   deleted: (available hoist1) (in crate6 truck1)
   added: (lifting hoist1 crate6)
   goals met: 0 of 6
11. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 0 of 6
12. (drop hoist2 crate2 crate5 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate5)
   added: (at crate2 distributor1) (available hoist2) (on crate2 crate5) (clear crate2)
   goals met: 0 of 6
13. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 0 of 6
14. (drop hoist1 crate6 pallet1 distributor0)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (at crate6 distributor0) (available hoist1) (on crate6 pallet1) (clear crate6)
   goals met: 1 of 6
15. (lift hoist2 crate2 crate5 distributor1)
   deleted: (at crate2 distributor1) (available hoist2) (on crate2 crate5) (clear crate2)
   added: (lifting hoist2 crate2) (clear crate5)
   goals met: 1 of 6
16. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   goals met: 1 of 6
17. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 1 of 6
18. (unload hoist1 crate2 truck1 distributor0)
   deleted: (available hoist1) (in crate2 truck1)
   added: (lifting hoist1 crate2)
   goals met: 1 of 6
19. (lift hoist2 crate5 crate3 distributor1)
   deleted: (at crate5 distributor1) (available hoist2) (on crate5 crate3) (clear crate5)
   added: (lifting hoist2 crate5) (clear crate3)
   goals met: 1 of 6
20. (drop hoist1 crate2 crate6 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate6)
   added: (at crate2 distributor0) (available hoist1) (on crate2 crate6) (clear crate2)
   goals met: 2 of 6
21. (load hoist2 crate5 truck0 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   goals met: 2 of 6
22. (lift hoist2 crate3 pallet2 distributor1)
   deleted: (at crate3 distributor1) (available hoist2) (on crate3 pallet2) (clear crate3)
   added: (lifting hoist2 crate3) (clear pallet2)
   goals met: 2 of 6
23. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   goals met: 2 of 6
24. (unload hoist2 crate5 truck0 distributor1)
   deleted: (available hoist2) (in crate5 truck0)
   added: (lifting hoist2 crate5)
   goals met: 2 of 6
25. (drop hoist2 crate5 pallet2 distributor1)
   deleted: (lifting hoist2 crate5) (clear pallet2)
   added: (at crate5 distributor1) (available hoist2) (on crate5 pallet2) (clear crate5)
   goals met: 3 of 6
26. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 3 of 6
27. (lift hoist0 crate7 crate4 depot0)
   deleted: (at crate7 depot0) (available hoist0) (on crate7 crate4) (clear crate7)
   added: (lifting hoist0 crate7) (clear crate4)
   goals met: 3 of 6
28. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   goals met: 3 of 6
29. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 3 of 6
30. (unload hoist1 crate7 truck0 distributor0)
   deleted: (available hoist1) (in crate7 truck0)
   added: (lifting hoist1 crate7)
   goals met: 3 of 6
31. (drop hoist1 crate7 crate2 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate2)
   added: (at crate7 distributor0) (available hoist1) (on crate7 crate2) (clear crate7)
   goals met: 3 of 6
32. (lift hoist0 crate4 crate1 depot0)
   deleted: (at crate4 depot0) (available hoist0) (on crate4 crate1) (clear crate4)
   added: (lifting hoist0 crate4) (clear crate1)
   goals met: 3 of 6
33. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 3 of 6
34. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 3 of 6
35. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 3 of 6
36. (unload hoist1 crate4 truck1 distributor0)
   deleted: (available hoist1) (in crate4 truck1)
   added: (lifting hoist1 crate4)
   goals met: 3 of 6
37. (lift hoist0 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (available hoist0) (on crate1 crate0) (clear crate1)
   added: (lifting hoist0 crate1) (clear crate0)
   goals met: 3 of 6
38. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 3 of 6
39. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 3 of 6
40. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 3 of 6
41. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (available hoist0) (on crate0 pallet0) (clear crate0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 3 of 6
42. (lift hoist1 crate7 crate2 distributor0)
   deleted: (at crate7 distributor0) (available hoist1) (on crate7 crate2) (clear crate7)
   added: (lifting hoist1 crate7) (clear crate2)
   goals met: 3 of 6
43. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   goals met: 3 of 6
44. (unload hoist1 crate4 truck0 distributor0)
   deleted: (available hoist1) (in crate4 truck0)
   added: (lifting hoist1 crate4)
   goals met: 3 of 6
45. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   goals met: 3 of 6
46. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 3 of 6
47. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 3 of 6
48. (unload hoist0 crate7 truck0 depot0)
   deleted: (available hoist0) (in crate7 truck0)
   added: (lifting hoist0 crate7)
   goals met: 3 of 6
49. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (at crate7 depot0) (available hoist0) (on crate7 pallet0) (clear crate7)
   goals met: 4 of 6
50. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 4 of 6
51. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 4 of 6
52. (unload hoist0 crate4 truck1 depot0)
   deleted: (available hoist0) (in crate4 truck1)
   added: (lifting hoist0 crate4)
   goals met: 4 of 6
53. (drop hoist0 crate4 crate7 depot0)
   deleted: (lifting hoist0 crate4) (clear crate7)
   added: (at crate4 depot0) (available hoist0) (on crate4 crate7) (clear crate4)
   goals met: 5 of 6
54. (unload hoist0 crate0 truck1 depot0)
   deleted: (available hoist0) (in crate0 truck1)
   added: (lifting hoist0 crate0)
   goals met: 5 of 6
55. (drop hoist0 crate0 crate4 depot0)
   deleted: (lifting hoist0 crate0) (clear crate4)
   added: (at crate0 depot0) (available hoist0) (on crate0 crate4) (clear crate0)
   goals met: 6 of 6
